{
  "Pages": [
    {
      "title": "visakan mathivannan",
      "id": "Home",
      "intro": "",
      "summary": [""]
    },
    {
      "title": "about me",
      "id": "About",
      "intro": "Find out about my my skills my expereinces and passions",
      "summary": [
        "I am an adaptable and driven individual with a versatile skillset that uniquely binds design and engineering principles.",
        "I have a passion for developing hardware and software of products using my innovative thinking and unique skillset to creatively solve problems."
      ]
    },
    {
      "title": "contact me",
      "id": "Contact",
      "intro": "Get in Contact with me",
      "summary": [
        "I am currently open to doing freelance front-end development and open to being contacted regarding short projects.",
        "In the long term I am looking to continue developing my skills as a Design Engineer and hope to involve myslef in the development of new products"
      ]
    },
    {
      "title": "my projects",
      "id": "Projects",
      "intro": "See some of the work I have produced in the past",
      "summary": [
        "As a design engineer it was important to develop interdisciplinary skils aswell as soft skills to enable teams to succeed together.",
        "Throughout my time at Imperial, I had the opportunity to work with a number of extraordinary engineers and different exciting projects where I could build and demonstrate my unique skills"
      ]
    }
  ],
  "Projects": [
    {
      "title": "CODA: Making Music Practice More Meaningful",
      "titleShort": "CODA",
      "tags": [
        "Medical Robotics",
        "Hardware",
        "Open Source",
        "Additive Manufacturing"
      ],
      "image": "https://i.imgur.com/ZPikZKd.png",
      "summary": "A business venture where we develop a device to track how you play the drums and show you how to improve.",
      "Process": [
        {
          "title": "CODA: Making Music Practice More Meaningful",
          "text": [
            "An innovative business venture with the goal of creating a platform for musicians to share their experiences and track their progress. The device and platform is designed with the intention of helping aspiring musicians practice and stay engaged regardless of the initial struggles when learning an instrument."
          ],
          "image": "https://i.imgur.com/ZPikZKd.png",
          "video": ""
        },
        {
          "title": "Market Research",
          "text": [
            "Extensive Research was conducted into validity of the market. We analysed the potential size of the market we would be entering identify the specifc segments that we were interested in. Within these segments we analysed trends to justify to potential investors that the product being pitched was capable of strong growth and pitched at the Imperial Enterprise Lab as a part of the innovation pitch."
          ],
          "image": "",
          "images": [
            {
              "original": "https://i.imgur.com/Z9ddOhE.png",
              "thumbnail": "https://i.imgur.com/1NuTMLc.png"
            },
            {
              "original": "https://i.imgur.com/GIeyXoN.png",
              "thumbnail": "https://i.imgur.com/MlB4RJg.png"
            },
            {
              "original": "https://i.imgur.com/kgTpaJj.png",
              "thumbnail": "https://i.imgur.com/gVYnmQd.png"
            }
          ],
          "video": ""
        },
        {
          "title": "Prototyping",
          "text": [
            "To better present the concept to investors a set of “looks-like”, “feels-like and “works-like” prototypes were made. The “feels-like” prototypes were made through a series of iterations testing different weights, which allowed intensive user testing and the “works-like” prototype used an arudino combined with accelerometers and force sensors to demonstrate the key functionalities."
          ],
          "image": "",
          "images": [
            {
              "original": "https://i.imgur.com/SGjYr02.png",
              "thumbnail": "https://i.imgur.com/SGjYr02.png"
            },
            {
              "original": "https://i.imgur.com/v47Z28X.png",
              "thumbnail": "https://i.imgur.com/v47Z28X.png"
            },
            {
              "original": "https://i.imgur.com/iQBcGEF.gif",
              "thumbnail": "https://i.imgur.com/ZWaOxNp.png"
            },
            {
              "original": "https://i.imgur.com/rC4gMyz.gif",
              "thumbnail": "https://i.imgur.com/SnRq2DA.png"
            }
          ],
          "video": ""
        },
        {
          "title": "Soft Launch",
          "text": [
            "The final stage was to launch the website and video for the soft launch of the product. For this a series of high quality renders were developed to demonstrate the concept and a specific investor page was added for interested visitors. Furthermore, a Risk Register and 5 year Financial Projection was developed",
            "button https://codamusicteam.wixsite.com/coda Visit Website"
          ],
          "image": "",
          "images": [],
          "video": "https://youtu.be/zmOQAdV4Ynk"
        }
      ]
    },
    {
      "title": "Dog & Ball: The Automated Ball Thrower",
      "titleShort": "Dog & Ball",
      "tags": [
        "Human Centered Design",
        "CAD",
        "Rapid Prototyping",
        "Engineering Analysis"
      ],
      "image": "https://i.imgur.com/EpzSgnW.jpg",
      "summary": "A product opportunity where we create a specialised product targetting sufferers of muscular skeletal issues and cater to the mass market.",
      "Process": [
        {
          "title": "Dog & Ball: The Automated Ball Thrower",
          "image": "",
          "text": [
            "The dog and ball automated ball launcher is designed to enhance the relationship between person and there pet by making it easier them to exercise the Dog through the use of a ball. The automatic ball launcher is designed to remove the need to strain ones back or shoulder when throwing a ball during fetch."
          ],
          "video": "https://www.youtube.com/watch?v=1ssAqyN7chw"
        },
        {
          "title": "Ideation",
          "images": [
            {
              "original": "https://i.imgur.com/He8zFRT.png",
              "thumbnail": "https://i.imgur.com/He8zFRT.png"
            }
          ],
          "image": "https://i.imgur.com/He8zFRT.png",
          "video": "",
          "text": [
            "This project began with large amounts of ideation using a double diamond approach to come up with different design ideas and launch mechanisms. Four different designs were sketched and roughly prototyped in blue foam."
          ]
        },
        {
          "title": "Analysis",
          "images": [
            {
              "original": "https://i.imgur.com/nYmgV6B.png",
              "thumbnail": "https://i.imgur.com/nYmgV6B.png"
            },
            {
              "original": "https://i.imgur.com/7ROCUKv.png",
              "thumbnail": "https://i.imgur.com/7ROCUKv.png"
            }
          ],
          "image": "",
          "video": "",
          "text": [
            "Further research was conducted into the chosen mechanism and how viable it was with the low cost components found in relatively cheap donor products such as a hand drill. This required analysis of the required transmission ratios and power outputs. The launch velocities and ratios were plotted using MATLAB."
          ]
        },
        {
          "title": "Prototyping",
          "images": [
            {
              "original": "https://i.imgur.com/P833GzK.png",
              "thumbnail": "https://i.imgur.com/P833GzK.png"
            }
          ],

          "image": "https://i.imgur.com/P833GzK.png ",
          "video": "",
          "text": [
            "In order to further demonstrate proof of concept, a physical test rig was produced using rapid-prototyping methods. Additionally the user experience was explored. The focus was to achieve the correct weight distribution and create an ergonomic shape."
          ]
        },
        {
          "title": "Final Prototype",
          "images": [
            {
              "original": "https://i.imgur.com/n9EHzge.png",
              "thumbnail": "https://i.imgur.com/n9EHzge.png"
            },
            {
              "original": "https://i.imgur.com/g4CfQrY.png",
              "thumbnail": "https://i.imgur.com/g4CfQrY.png"
            },
            {
              "original": "https://i.imgur.com/vl9OSvk.png",
              "thumbnail": "https://i.imgur.com/vl9OSvk.png"
            }
          ],

          "image": "",
          "video": "",
          "text": [
            "A Cad model of the final prototype was designed and used to create a series of orthographic drawings and then the product was assembled and tested with our user groups."
          ]
        }
      ]
    },
    {
      "title": "Endo: The Open Source Continuum Robot",
      "titleShort": "Endo",
      "tags": [
        "Medical Robotics",
        "Hardware",
        "Open Source",
        "Additive Manufacturing"
      ],
      "image": "https://i.imgur.com/mX8v2TA.png",
      "summary": "A research project exploring how to make complex robotics more accessible through open source platforms.",
      "Process": [
        {
          "title": "Endo: The Open Source Continuum Robot",
          "text": [
            "A Continuum Manipulator is defined by its infinite degrees of freedom and is recognised within the field of robotics as a versatile tool specifically within medical fields. This project aimed to open up the technology and make it more available through the use of open source platforms such as GitHub and arduino. This would enable more researchers to access the field and furher develop the technology."
          ],
          "image": "https://i.imgur.com/mX8v2TA.png",
          "video": ""
        },
        {
          "title": "Design",
          "text": [
            "In accordance with the open source aspect the design of the robot utilised materials and production methods that were easily replicable. The designs were made using SOLIDWORKS and utilised a parametric design to enable other users to adjust key parameters such as spine length and diameter. These designs were made available on GitHub alongsie the Arduino control library.",
            "button https://github.com/OpenSourceMedicalRobots/Endo-Continuum-Robot Cad Design",
            "button https://github.com/OpenSourceMedicalRobots/Endo-Continuum-Robot-Library Arduino Library"
          ],
          "image": "https://i.imgur.com/DPc89Vu.png",
          "video": ""
        },
        {
          "title": "Control Algorithm",
          "text": [
            "One of the biggest hurdles in using continuum robots is the control mechanism. Due to the pliable nature of the robot, the kinematics is difficult and hard to mathematically model and therefore it is common to use an experimental approach to achieve a control mechanism. In order to enable this for future researches, an open source arduino library was developed and tested."
          ],
          "image": "https://i.imgur.com/pYgeX7g.png",
          "video": ""
        },
        {
          "title": "TMRB Publication",
          "text": [
            "Having completed the project I worked with the REDS LAB to focus on publishing my work in IEEE Transactions on Medical Robotics and Bionics"
          ],
          "image": "",
          "video": "https://www.youtube.com/watch?v=eEjlFD5Np10"
        }
      ]
    },
    {
      "title": "The Summer Show",
      "titleShort": "The Summer Show",
      "tags": ["Project Management", "Streaming", "Design"],
      "image": "https://i.imgur.com/gjjzWmU.jpg",
      "summary": "Producing the Design Engineering Show for 2020 graduates during Covid-19.",
      "Process": [
        {
          "title": "The Summer Show",
          "text": [
            "A team of students, lecturers and volunteers produced and ensured the success of the Design Engineering Summer Show. The show was designed to be a platform for graudating students to present the work initially a physical show that due to the onset of Covid 19 was transferred online."
          ],
          "image": "https://i.imgur.com/gjjzWmU.jpg",
          "video": ""
        },
        {
          "title": "Events Manager",
          "images": [
            {
              "original": "https://i.imgur.com/pKvCBwm.png",
              "thumbnail": "https://i.imgur.com/pKvCBwm.png"
            },
            {
              "original": "https://i.imgur.com/9Xrp9zg.png",
              "thumbnail": "https://i.imgur.com/9Xrp9zg.png"
            },
            {
              "original": "https://i.imgur.com/TtErrkw.png",
              "thumbnail": "https://i.imgur.com/TtErrkw.png"
            }
          ],
          "image": "",
          "video": "",
          "text": [
            "The physical show would involve a series of guest talks that needed to be transitioned online. My role involved ensuring these events were successfully delivered through the online platform and to communicate with the guest speakers to collate information and ensure they were prepared. These were delivered using the streamyard platform and directed through to the dyson youtube channel and and the events page on the Show.",
            "button https://deshowcase.london/ Visit Show",
            "button https://www.youtube.com/playlist?list=PLQV0kdytAgUAxtayeE1KXISqFbm9Fd0rp Live Events"
          ]
        }
      ]
    }
  ]
}
